const Map<String, String> ar_roles ={
  "User":"مستخدم",
  "Doctor":"دكتور",
  "Admin":"مدير",
};
const Map<String, String> ar_pages ={
  "Web browser":"متصفح الويب",
  'Home':'الرئيسية',
  'Speech Recognition':'التعرف على الكلام',
  'Text Copied to Clipboard':'تم نسخ النص إلى الحافظة',
  "My posts":'منشوراتي',
  "Aboute": "من نحن",
  "Profile": "الملف الشخصي",
  "Edit profile": "تعديل الملف الشخصي",
  'Posts':  'المنشورات',
  'Forum':  'المنتدى',
  'Voice Chat':  'الدردشة الصوتية',
  'Broadcast Live':  'البث المباشر',
  'DashBoard':'لوحة التحكم',
  'Care Schedules':'جدول العناية',
  'Age Groups':'الفئات العمرية',
  'Age Group':'الفئة العمرية',
  "Care Types":'انواع الرعاية',
  "Care Type":'نوع الرعاية',
  "Daily Care Times":"مواعيد الرعاية اليومية",
  "Chose Time":"تحديد موعد الرعاية",
  "Active":"تفعيل",
  "Time":"الوقت",
  "Select time of day":"قم باختيار الوقت",
  "Edit person data":"تعديل المعلومات الشخصية",

};
const Map<String, String> _ar = {
  "AppName":"Mom's Care",
  "Arabic":"العربية",
  "English":"الانجليزية",
  "AppDescribe":"ارشاد الامهات بطرق الرعاية الصحيحة للعناية بالاطفال",
  "Schedule": "الجدول",
  "Departments": "الاقسام",
  "Home": "الرئيسية",
  "Name": "الأسم",
  "Gender":"الجنس",
  'Contact Us': "تواصل معنا",
  'View hall information': "عرض معلومات القاعة ",
  "Class":"القاعة الدراسية",
  'Lectures': " المحاضرات اليومية",
  "Aboute": "من نحن",
  "Profile": "الملف الشخصي",
  "Edit personal name": "تعديل الاسم الشخصي",
  "LevelId": "رقم المستوى الدراسي",
  "Level": " المستوى الدراسي",
  "Colleges": "الكليات",
  "SudentId": "رقم الطالب الاكاديمي ",
  "Academic Id": "الرقم  الاكاديمي ",
  "Enter the academic number": "ادخل الرقم الاكاديمي ",
  "SectionId": " رقم القسم",
  "Enter the full name": "ادخل الاسم الكامل",
  "Choose your academic level": "اختر المستوى الدراسي",
  "Choose your college": "اختر الكلية",
  "Choose the academic department": "اختر القسم الاكاديمي",
  "Edit personal email": "تعديل الايميل الشخصي",
  "Diagnoses": "التشخيصات",
  "Total diagnoses": "إجمالي التشخيصات",
  "Settings": "إعدادات",
  "Change Password": "تعديل كلمة المرور",
  "Verification code": "رمز التحقق",
  "Confirm verification code": "تأكيد رمز التحقق",
  "First Name": "الاسم الاول",
  "Last Name": "الاسم الاخير",
  "Login": "تسجيل الدخول",
  "LogOut": "تسجيل الخروج",
  "Save": "حــفظ",
  "Publish": "نشر",
  "Wait..": "إنتظر..",
  "Visit": "زيــارة",
  "Update": "تعديل",

  'Change language': "تغير اللغة",
  "Register": "تسـجــيل ",
  "Create an account": "انشاء حساب ",
  "ُError": "خطاء !",
  "Ok": "حسنا ",
  "Cancel": "إلغاء ",
  "Age":"العمر",
  "Edit": "تعــديل",
  "Delete": "حــذف",
  "Email": "البريد الالكتروني ",
  "Password": " كلمة السر ",
  "Enter Password": " ادخل كلمة السر ",
  "Current Password": " كلمة السر الحالية",
  "New Password": " كلمة السر الجديدة",
  "Enter New Password": " ادخل كلمة السر الجديدة",
  "Enter Current Password": " ادخل كلمة السر الحالية",
  "Confirm Password": " تأكيد كلمة المرور ",
  "Enter Confirm Password": " ادخال تأكيد كلمة المرور ",
  "Enter valid email": " أدخل بريدًا إلكترونيًا صالحًا",
  "Enter First Name": " أدخل الاسم الاول",
  "Enter Last Name": " أدخل الاسم الاخير",
  "New User": "مستخدم جديد ؟ ",
  "Create Account": "إنشاء حساب",
  "You Have An Account ?": "لديك حساب ؟ ",
  "Forgot Password": "هل نسيت كلمة السر؟",
  "Reset Password":  "إعادة تعيين كلمة المرور",
  'Enter your email':  'ادخل البريد الالكتروني',
  'Send':  'ارســال',
  'Start':  'ابــداء',
  'Next':  'التالي',
  'Done':  'إكمال',
  'Comments':  'التعليقات',
  'Likes Received':  'معجبون',
  'Likes Given':  'معجب بهم',
  'Babies':  'أطفالي',
  'Menu':  'قائمة الاعدادات',
  'Skip':  'تخطي',
  'Alert':  'تنـبيه !',

  "loading":" جــاري التحمـيل ... ",
  "please wait":"يرجى الانتظار",
  "no content":"لايوجد  بيانات",
  'Click button to start recording':'انقر فوق الزر لبدء التسجيل',
  'Pick a file': 'إختر ملف',
  'Yes':'نعم',
  'No':'لا',


};
const Map<String, String> ar_aboute= {
  "Aboute App":"تطبيق يساعد الامهات  على العناية بالاطفال من خلال تقديم النصائح والارشادات  وجدولة المواعيد ومشاركة الاستفسارات مع منتدى الامهات ",
  "About2": "منتدى رعاية متكامل للامهات",
  "Features":"المميزات",
  "Feature1": "تقديم مجموعة من الدروس والنصائح حول طرق العناية الصحيحة بالاطفال",
  "Feature2":"يقدم التطبيق منتدى يتيح للمستخدمين نشر الاستفسارات والرد عليها ومشاركة المعلومات فيما بينهم",
  "Feature3":"يسمح التطبيق للمستخدمين تصفح المنشورات في المنتدى والرد عليهم من خلال اضافة تعليق ",
  "Feature4":"يتيح التطبيق الاعجاب او الغاء الاعجاب بالمنشورات والتعليقات ",


};

const Map<String, String> ar_days = {
  "monday": "الإثنين",
  "tuesday": "الثلاثاء",
  "wednesday": "الأربعاء",
  "thursday": "الخميس",
  "friday": "الجمعة",
  "saturday": "السبت",
  "sunday": "الأحد"
};
const Map<String, String> ar_text_generate_rules = {
  "Hello! How can I help you today?":"مرحبًا! كيف يمكنني مساعدتك اليوم؟",
  "UserQuestion:": "سؤال المستخدم",
  "Gemini_Model_Specialization": "الرعاية الصحية للأطفال الرضع والأمهات",
  "docs":'''
  السلام عليكم : وعليكم السلام ورحمة الله وبركاتة مرحبًا! كيف يمكنني مساعدتك اليوم؟
   اخبرني عن نفسك : أنا مساعد افتراضي تم تدريبي لتقديم المساعدة والمعلومات حول الرعاية الصحية للأطفال الرضع والأمهات
    ما هو تخصصك ؟: تخصصي هو مجال الرعاية الصحية للأطفال الرضع والأمهات
    أين تعمل؟ : أعمل كمساعد افتراضي  في تطبيق Moms Care مخصص للرعاية الصحية للأطفال الرضع والأمهات
    ماذا تقدم؟ : أقدم نصائح وإرشادات  حول الرعاية الصحية للأطفال الرضع والأمهات
    يجب ان تكون اجابتك  باللغة الانجليزية  .
    يجب حذف اي علامات او رموز  اخرى ليست حروف هجائية اوارقام
    ''',
  // "GenerateTextRules":"اولا يجب ان تعرف بأنك تخصصك في المحادثة هو مجال الرعاية الصحية للأطفال الرضع والأمهات  . "
  //     "يجب عليك الالتزام بالشروط والقواعد  التالية عند الاجابة على اسئلة المستخدم : "
  //     "- يجب ان تكون اجابتك  مفيدة ومختصرة وواضحة ذات معنى يحقق المطلوب المراد من السؤال."
  //     // "2- يجب ان الاجابات مقتصرة على موضوع الرعاية الصحية للأمهات والاطفال واي موضوع له علاقة باللأمهات واطفالهن كما يجب عليك الحذر من  الاجابة عن اي اسئلة اخرى ليست ضمن الموضوع وفي حال كانت هناك اسئلة يجب عليك الاعتذار  بعدم القدرة على الرد وانك مخصص فقط لاي موضوع يتعلق بالرعاية الصحية للاطفال .   "
  //     " - يجب عدم إعادة اي رموز او اشكال اخرى غير الحروف الهجائية . "
  //     "- ويجب عدم اضافة اي نص او كلام اخر لايتعلق بالموضوع المحدد ."
  //     "5- يمنع منعا باتاً الاجابة او الرد عن المواضيع المتعلقة بالسياسية , الاقتصاد , الرياضة , الجنس , السب والشتم والدين والثقافة الجنسية والعسكرية , وغيرها من المواضيع التي ليس لها اي علاقة بموضوع الرعاية الصحية للأطفال الرضع والأمهات ويجب  الاعتذار عن الرد عن اي سؤال خارج عن هذا الموضوع ."
  //     "يجب عليك الالتزام والتقيد بالشروط  السابقة في كل اجابة ويستثنى من تلك الشروط التحية والسؤال عن الحال والتطمينات والتعريف بنفس والتحدث عن وظيفتك واي مواضيع اخرى ليست مخالفة لشروط  "
  //     "يجب ان لايتم الاجابة حتى يطلب منك ذلك ",
  "GenerateTextRules":'''يجب تجنب الاجابة عن الاسئة التي تقع ضمن المجالات التالية (السياسة,الازدواجية,الحروب,حقوق الانسان,الجانب العسكري, السكس ,الاباحية).
  يجب ان تكون اجابتك  مفيدة ومختصرة وواضحة ذات معنى يحقق المطلوب المراد من السؤال بشكل مختصر.
   يجب عدم إعادة اي رموز او اشكال اخرى
   يجب عدم اضافة اي نص او كلام اخر لايتعلق بالموضوع المحدد
  .فقط يجب ان تكون الاجابة بشكل كامل بالعربي       
   ''',

};
const Map<String, String> ar_labels = {
  "AgeGroup":"الفئة العمرية",
  "DailyCareTimes":"أوقات الرعاية اليومية",
  "CareTypes":"أنواع الرعاية",
  "Course Items":"محتويات الدرس",
  "View Course Items":"عرض محتويات الدرس",
  "Courses":"الــدروس",
  "Add Course":"إضافة درس",
  "Visit link":"رابط الزيارة",
  "Browse the site":"تصفح الموقع",
  "Browse the site via the link":"تصفح الموقع عبر الرابط",
  "Update Course":"إضافة درس",
  "Add Item":"اضافة عنصر",
  "Update Item":"تعديل عنصر",
  "Course Details":"تفاصيل الدرس",
  "Image uploaded successfully":"تم رفع الصورة  بنجاح",
  "File uploaded successfully":"تم رفع الملف بنجاح",
  "Edit name":"تعــديل الاسم",
  "Edit email":"تعــديل البريد الالكتروني",
  "Edit password":"تعــديل كلمة السر",
  "Camera":"كاميراء",
  "Male":"ذكر",
  "Female":"انثى",
  "Height":"الطول",
  "Baby details":"معلومات الطفل",
  "Add Baby":"إضافة طفل",
  "Enter Number":"ادخل الرقم",
  "Enter height (gram)":"ادخل وزن الطفل (كيلوا جرام)",
  "Enter baby name":"ادخل اسم الطفل",
  "Enter height (cm)":"ادخل طول الطفل (سـم)",
  "Update Baby":"تعديل بيانات الطفل",
  "Edit Baby":"تعديل بيانات الطفل",
  "Number of Responsible Doctor":"رقم هاتف الطبيب المسؤول",
  "Weight":"الــوزن",
  "Back":"رجـــوع",
  "Comments":"التعليقات",
  "Add":"إضــافة",
  "ُEdit":"تعديل",
  "Add link":"إضافة رابط ",
  "link":"رابط",
  "Months":"اشهر",
  "Years":"سنين",
  "file":"ملف",
  "Change to file":"تغيير إلى الملف",
  "Attach file":"إرفاق ملف",
  "Attach link":"إرفاق رابط",
  "Change to link":"تغيير إلى رابط",
  "Date of Birth":"تاريخ الميلاد",
  "Select the Date of Birth":'اختر تاريخ ميلادك',
  "Gallery":"معرض الصور",
  "Tips and instructions":"النصائح والارشادات",
  "Choose the image source":"اختر مصدر الصورة",
  "Title":"العنوان",
  "Description":"الوصف",
  "Course Type":"نوع الدرس",
  "Descript":"الوصف",
  "Describe":"الوصف",
  "Add Course Item":"إضافة عنصر لدرس",
  "Update Course Item":"تعديل عنصرالدرس",
  'Add Broadcast Live':  'إضافة بث مباشر',
  'Update Broadcast Live':  'تعديل البث مباشر',
  'Broadcast Live Url Link':  'رابط البث المباشر',
  'Enter Broadcast Live Url Link':  'ادخل رابط البث المباشر',

};
const Map<String, String> ar_languages = {
  "Arabic":"العربية",
  "English":"الانجليزية",

};
const Map<String, String> ar_messages = {

  "Already have an account? Log in":"هل لديك حساب؟ سجل في",
  "Hello 👋":"مرحـبا 👋",
  "Hello, our dear visitor 👋":"مرحباً زائرنا العزيز 👋",
  "Please enter your email  and name to create an account...":"الرجاء إدخال بريدك الإلكتروني واسمك لإنشاء حساب...",
  "Don't have an account? Create an account":"ليس لديك حساب؟ قم بإنشاء حساب",
"Please enter your email to benefit from the care services...":"الرجاء إدخال  البريد الالكتروني للاستفادة من خدمات الرعاية ...",
  'The input field cannot be empty':'لا يمكن أن يكون حقل الإدخال فارغًا',
  'Added successfully':'تم الاضافة بنجاح',
  'Modified successfully':"تم التعديل بنجاح",
  'Deleted successfully':"تم الحذف بنجاح",
  "Do you really want to log out":"هل تريد تسجيل الخروج حقاً ؟",
  "Are you sure, you want to Logout?":"هل أنت متأكد أنك تريد تسجيل الخروج؟",
  "Login successful":"تم تسجيل الدخول بنجاح",
  "Register successful":"تم انشاء حساب بنجاح",
  "Empty":"فارغ لايوجد محتوى ",
  "EmptyPost":"لا يوجد لديك اي منشورات ",
  "EmptyBabies":"لا يوجد لديك  أطفال مسجلين  ",
  "The current  request will be cancelled. Are you ok with that":"سيتم الغاء الطلب  الحالي هل انت موافق على ذلك ؟",
  "The current item will be deleted. Do you agree with that?":"سيتم حذف العنصر الحالي هل انت موافق على ذلك  ؟",
  "The current broadcast will be ended. Do you agree with that?":"سيتم ايقاف البث المباشر  هل انت موافق على ذلك  ؟",
  "The process was completed successfully":"تمة العملية بنجاح",
  "Do you want to cancel the current order already":"هل تريد الغاء الطلب الحالي بالفعل ؟",
  "INPUT_FIELD_PHONE_NUMBER_ERROR_MESSAGE":"حقل رقم الهاتف لا يجب أن يكون فارغًا ويجب أن يتكون من 9 أرقام",
};
const Map<String, String> ar_errors= {

"Password verification message":"يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل وعلى حروف كبيرة   وصغيرة ورموز",
"no internet connection" : " لايوجد شبكة تحقق من الاتصال  بالانترنت  !! ",
"no connection": "لا يوجد اتصال",
"Field is Empty":"لايمكنك ترك حقل الادخال فارغ",
"Email is invalid":"البريد الإلكتروني غير صالح",
"Login failed":"فشل عملية تسجيل الدخول",
"Register failed":" فشل عملية انشاء حساب!",
"Password does not match":"كلمة السر غير مطابقة",
"Password is not Valid":" يجب ان تحتوي كلمة المرور على حروف كبيرة وصغيرة وارقام ورموز وان لاتقل عن 6 احرف",
 "Password is inValid":"كلمة السر غير صالحة",
"name is invalid":" الاسم غير صالح",
"unexpected error":"حدث خطاء غير متوقع , الرجاء المحاولة مرة اخرى ",
"Failed operation":"عملية فاشلة   , الرجاء المحاولة مرة اخرى ",
"Different email": " يجب عليك استخدام بريد الكتروني مختلف عن البريد الالكتروني السابق .",
"Different password":"كلمة السر الجديدة مطابقة لكملة السر الحالية يجب استخدام كلمة سر مختلفة ",
"The image content is invalid":"محتوى الصورة غير صالح",
'No Text Found':  "لم يتم العثور على نص",
  "NOT_ALLOW_OPENING_BROADCAST_LIVE_MESSAGE":"لديك بث نشط حاليا لايمكنك انشاء اكثر من بث في نفس الوقت !",
};



Map<String, String> get ar {
  return {}
    ..addAll(_ar)
    ..addAll(ar_messages)
    ..addAll(ar_errors)
    ..addAll(ar_labels)
    ..addAll(ar_aboute)
    ..addAll(ar_text_generate_rules)
    ..addAll(ar_days)
    ..addAll(ar_pages)
    ..addAll(ar_roles)
    ..addAll(ar_languages);

}